/* Файл включения для работы со стеком.
	Содержит дескриптор стека и функции для работы
	со стеком. Включается в головной файл после
	определения элемента стека с именем EL */
/* Хусаинов Б.С. c:\bc\xbs\stack\incl_stc.c */
#define STC struct st
STC   /* дескриптор стека */
{
    EL *un; /* Указатель начала стека */
    int uk; /* Указатель конца стека */
    int uv; /* Указатель вершины стека */
    int m;  /* число элементов в стеке */
} s1; /* s1 -переменная типа STC */
/* ========================================== */
/*      ДОБАВЛЕНИЕ ЭЛЕМЕНТА В СТЕК   */
int  Push_el(STC *s,EL el)
{
    if (s->un == NULL)  /*стек не создан */
        return -2;
    if (s->uv == s->uk)
        return -1;   /* стек полон */
    *(s->un + s->uv+1) = el;
    ++s->uv;
    return 0;
}
/* ========================================== */
/*       ВЫБОРКА ЭЛЕМЕНТА ИЗ СТЕКА     */
int Pop_el(STC *s,EL *el)
{
    if (s->un == NULL)
        return -2;  /* стек не создан */
    if (s->uv < 0)
        return -1; /* стек пуст */
    else
    {
        *el = *(s->un + s->uv);
        --s->uv;
        return 0;
    }
}
/* ========================================== */
/* ИЗВЛЕЧЕНИЕ ЗНАЧЕНИЯ ЭЛЕМЕНТА ИЗ СТЕКА БЕЗ УДАЛЕНИЯ ЭЛЕМЕНТА  */
int Peek_el(STC *s,EL *el)
{
    if (s->un == NULL)
        return -2;  /* стек не создан */
    if (s->uv < 0)
        return -1; /* стек пуст */
    else
    {
        *el = *(s->un + s->uv);
        return 0;
    }
}
/* ========================================== */
/*       ОСВОБОЖДЕНИЕ СТЕКА       */
int Destroy_stc(STC *s)
{
    free(s->un);
    s->un = NULL;
    return 0;
}
/* ========================================== */
/*      СОЗДАНИЕ СТЕКА           */
int Crt_stc(STC *s)
{
    int nn=12; /* число элементов стека */
    if (s->un != NULL)
    {
        printf("\n Старый стек уничтожить? (y/n) ");
        fflush(NULL);
        if (getchar() != 'y')
        {
            printf("\n Работаем со старым стеком");
            return -2;
        }
    }
    s->un = (EL*) calloc(nn,sizeof(EL));
    if (s->un == NULL)
        return -1; /* память не выделена */
    else
    {
        s->uv = -1;
        s->uk = nn-1;
        s->m = nn;
        return 0;
    }
}
/* *************************************************** */
