/* ********************************************** */
/* Расстановка 8 ферзей, одно решение.\ferzyr1.c */

#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
#define n 8
int a[8], i, x[8], b[15], c[15], *p;
/* ============================================== */
/* РЕКУРСИВНАЯ ФУНКЦИЯ ОДНОЙ РАССТАНОВКИ ФЕРЗЕЙ   */
Try(int i, int *q)
{
    /* i - номер шага,
       q - признак его успешности   */
    int j;			/* j - номер варианта */
    j = 0;
    do
    {
        j = j + 1;
        *q = 0;
        if (a[j - 1] && b[i + j - 2] && c[i - j + 7])  	/* вариант подходит ? */
        {
            x[i - 1] = j;
            a[j - 1] = 0;
            b[i + j - 2] = 0;
            c[i - j + 7] = 0;
            if (i < 8)
            {
                Try(i + 1, q);
                if (!*q)
                {
                    a[j - 1] = 1;
                    b[i + j - 2] = 1;
                    c[i - j + 7] = 1;
                }
            }
            else
                *q = 1;
        }
    }
    while (!(*q || (j == n)));
}

/* =========================================================== */
main()
{
    setlocale(LC_ALL,"Russian");
    int k;
    /* Инициализация массивов состояний вертикалей и диагоналей */
    for (k = 0; k < n; k++)
        a[k] = 1;
    for (k = 0; k < 14; k++)
    {
        b[k] = 1;
        c[k] = 1;
    }
    /* Расстановка ферзей */
    Try(1, &p);
    printf("\n");
    /* Печать результатов */
    for (k = 0; k < n; k++)
        printf(" %d ", x[k]);
    getchar();
}

/* ********************************************************* */
