/* ******************************************************** */
/* Задача о шахматном коне \koni/c */
#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
//#include <conio.h>
#define n 8
#define n2 n*n			/* n*n -размер доски */
int i, j, q,			/* код возврата из рекурсивной функции */
    h[n][n];			/*    поле доски */
int a[8] = { 2, 1, -1, -2, -2, -1, 1, 2 };	/* приращения координаты х */
int b[8] = { 1, 2, 2, 1, -1, -2, -2, -1 };	/* приращения координаты у */

static long int c = 0;		/* счетчик рекурсий */
/* ======================================================= */
void step(int ii, int x, int y, int *qq)
/* ii  - номер хода, следующего c поля (х,у);             */
/*      x,y - координаты поля, откуда следует ход;          */
/*      qq  - код возврата                                  */
{
    int k,			/* номер варианта */
        u, v,			/* координаты следующего поля */
        q1;			/* код возврата при рекурсивном вызове */
    c++;			/* счетчик обращений к функции, для любопытных */
    /* Можно посмотреть, как проходит процесс */
    /* { printf("\n i= %d ",ii-1); c=0;
    	  for (i=0; i<n; i++)
    		 { printf("\n");
    			for (j=0; j<n; j++)
    			  printf(" %d ",h[i][j]);
    		 }
    	getchar();}
     */
    k = -1;
    do
    {
        k++;
        q1 = 0;
        u = x + a[k];
        v = y + b[k];
        if ((u >= 0 && u < n) && (v >= 0 && v < n))
            if (h[u][v] == 0)
            {
                h[u][v] = ii;
                if (ii < n2)
                {
                    step(ii + 1, u, v, &q1);	/* РЕКУРСИЯ !!! */
                    if (q1 == 0)
                        h[u][v] = 0;
                }
                else
                    q1 = 1;
            }
    }
    while (!q1 && k != 8);
    *qq = q1;
}

/* ======================================================= */
int main()
{
    setlocale(LC_ALL,"Russian");
    printf
    ("\n\n Обход конем %d-клеточной шахматной доски, подождите",
     n2);
    for (i = 0; i < n; i++)
        for (j = 0; j < n; j++)
            h[i][j] = 0;
    h[0][0] = 1;		/* исходное положение коня */
    c = 0;
    step(2, 0, 0, &q);		/* номер хода; координаты поля, где конь */
    printf("\n Число рекурсий с=%ld", c);
    printf("\n Результаты обхода:");
    if (q)
        for (i = 0; i < n; i++)
        {
            printf("\n");
            for (j = 0; j < n; j++)
                printf("%4d", h[i][j]);
        }
    else
        printf("\n Нет решения");
    getchar();
}

/* ******************************************************** */
